Jiu-xiao/libxr/driver/mspm0/mspm0_uart.cpp
#include "mspm0_uart.hpp"

#include <algorithm>
#include <cstdint>
#include <limits>

using namespace LibXR;

namespace
{

constexpr uint64_t UART_UINT32_MAX = 0xFFFFFFFFULL;
constexpr uint64_t UART_BAUD_DIVISOR_MIN = 1ULL << 6U;
constexpr uint64_t UART_BAUD_DIVISOR_MAX = 0xFFFFULL << 6U;
constexpr DL_DMA_Config UART_DMA_TX_CONFIG = {
    .trigger = 0U,
    .triggerType = DL_DMA_TRIGGER_TYPE_EXTERNAL,
    .transferMode = DL_DMA_SINGLE_TRANSFER_MODE,
    .extendedMode = DL_DMA_NORMAL_MODE,
    .srcWidth = DL_DMA_WIDTH_BYTE,
    .destWidth = DL_DMA_WIDTH_BYTE,
    .srcIncrement = DL_DMA_ADDR_INCREMENT,
    .destIncrement = DL_DMA_ADDR_UNCHANGED,
};

#if defined(DEVICE_HAS_DMA_FULL_CHANNEL)
constexpr DL_DMA_Config UART_DMA_RX_CONFIG = {
    .trigger = 0U,
    .triggerType = DL_DMA_TRIGGER_TYPE_EXTERNAL,
    .transferMode = DL_DMA_FULL_CH_REPEAT_SINGLE_TRANSFER_MODE,
    .extendedMode = DL_DMA_NORMAL_MODE,
    .srcWidth = DL_DMA_WIDTH_BYTE,
    .destWidth = DL_DMA_WIDTH_BYTE,
    .srcIncrement = DL_DMA_ADDR_UNCHANGED,
    .destIncrement = DL_DMA_ADDR_INCREMENT,
};
#endif

// 校验 DriverLib 分频算式及寄存器可表示范围 / Check divider arithmetic and register
// range.
bool BaudRateRepresentable(uint32_t clock_freq, uint32_t baudrate)
{
  if (baudrate == 0U || baudrate > (UART_UINT32_MAX / 16U))
  {
    return false;
  }

  const uint64_t clock = clock_freq;
  const uint64_t baud = baudrate;
  uint64_t divisor = 0U;
  if ((baud * 8U) > clock)
  {
    if (clock > (UART_UINT32_MAX / 64U))
    {
      return false;
    }
    divisor = (clock * 64U) / (baud * 3U);
  }
  else if ((baud * 16U) > clock)
  {
    if (clock > (UART_UINT32_MAX / 8U))
    {
      return false;
    }
    const uint64_t half_baud = baud / 2U;
    if (half_baud == 0U)
    {
      return false;
    }
    divisor = (((clock * 8U) / half_baud) + 1U) / 2U;
  }
  else
  {
    if (clock > (UART_UINT32_MAX / 8U))
    {
      return false;
    }
    divisor = (((clock * 8U) / baud) + 1U) / 2U;
  }

  return divisor >= UART_BAUD_DIVISOR_MIN && divisor <= UART_BAUD_DIVISOR_MAX;
}

// 间隔阈值覆盖最长帧内高电平和一个完整字符 / Cover the longest high span plus one
// character.
uint64_t GapCompare(uint32_t clock_freq, UART::Configuration config)
{
  if (clock_freq == 0U || config.baudrate == 0U)
  {
    return 0U;
  }

  const uint64_t parity_bits = config.parity == UART::Parity::NO_PARITY ? 0U : 1U;
  const uint64_t high_bits = config.data_bits + parity_bits + config.stop_bits;
  const uint64_t gap_bits = high_bits + (1U + high_bits);
  const uint64_t numerator = static_cast<uint64_t>(clock_freq) * gap_bits;
  return (numerator / config.baudrate) + ((numerator % config.baudrate) != 0U ? 1U : 0U);
}

}  // namespace

MSPM0UART* MSPM0UART::instance_map_[MAX_UART_INSTANCES] = {nullptr};

MSPM0UART::MSPM0UART(Resources res, RawData tx_dma_storage, RawData rx_dma_storage,
                     uint32_t tx_queue_size, uint32_t rx_queue_capacity,
                     UART::Configuration config)
    : UART(&_read_port, &_write_port),
      _read_port(rx_queue_capacity),
      _write_port(tx_queue_size, tx_dma_storage.size_ / 2U),
      res_(res),
      tx_dma_storage_(tx_dma_storage),
      rx_dma_storage_(rx_dma_storage),
      tx_half_size_(tx_dma_storage.size_ / 2U)
{
  ASSERT(res_.instance != nullptr);
  ASSERT(res_.clock_freq > 0U);
  ASSERT(res_.index < MAX_UART_INSTANCES);
  ASSERT(res_.index == ResolveIndex(res_.irqn));
  ASSERT(instance_map_[res_.index] == nullptr);
  ASSERT(tx_dma_storage_.addr_ != nullptr);
  ASSERT(tx_dma_storage_.size_ > 1U);
  ASSERT((tx_dma_storage_.size_ % 2U) == 0U);
  ASSERT((reinterpret_cast<uintptr_t>(tx_dma_storage_.addr_) % alignof(size_t)) == 0U);
  ASSERT((tx_dma_storage_.size_ % (2U * alignof(size_t))) == 0U);
  ASSERT(tx_half_size_ <= MSPM0_UART_DMA_MAX_TRANSFER_SIZE);
  ASSERT(tx_queue_size > 0U);
  ASSERT(rx_queue_capacity > 0U);

  if (res_.rx_mode == RxMode::EXTEND_DMA)
  {
    ASSERT(rx_dma_storage_.addr_ != nullptr);
    ASSERT(rx_dma_storage_.size_ > 1U);
    ASSERT((rx_dma_storage_.size_ % 2U) == 0U);
    ASSERT(rx_dma_storage_.size_ <= MSPM0_UART_DMA_MAX_TRANSFER_SIZE);
    ASSERT(res_.dma_rx_channel < DMA_SYS_N_DMA_FULL_CHANNEL);
  }
  else
  {
    ASSERT(rx_dma_storage_.addr_ == nullptr);
    ASSERT(rx_dma_storage_.size_ == 0U);
    ASSERT(!res_.rx_half_interrupt);
    ASSERT(res_.dma_rx_channel == INVALID_DMA_CHANNEL);
  }

  ASSERT(res_.dma_tx_channel < MAX_DMA_CHANNELS);
  ASSERT(res_.dma_tx_trigger != 0U);
  if (res_.rx_mode == RxMode::EXTEND_DMA)
  {
    ASSERT(res_.dma_rx_channel < MAX_DMA_CHANNELS);
    ASSERT(res_.dma_rx_channel != res_.dma_tx_channel);
    ASSERT(res_.dma_rx_trigger != 0U);
    ASSERT(res_.dma_rx_trigger != res_.dma_tx_trigger);
    ASSERT(!res_.rx_half_interrupt || res_.dma_rx_channel < 8U);
  }

  for (const MSPM0UART* other : instance_map_)
  {
    if (other == nullptr)
    {
      continue;
    }

    ASSERT(res_.dma_tx_channel != other->res_.dma_tx_channel);
    if (other->res_.rx_mode == RxMode::EXTEND_DMA)
    {
      ASSERT(res_.dma_tx_channel != other->res_.dma_rx_channel);
    }

    if (res_.rx_mode == RxMode::EXTEND_DMA)
    {
      ASSERT(res_.dma_rx_channel != other->res_.dma_tx_channel);
      if (other->res_.rx_mode == RxMode::EXTEND_DMA)
      {
        ASSERT(res_.dma_rx_channel != other->res_.dma_rx_channel);
      }
    }
  }

  ASSERT(ValidateConfig(config) == ErrorCode::OK);
  _read_port.SetOwner(this);
  _write_port = WriteFun;

  NVIC_DisableIRQ(res_.irqn);
  NVIC_ClearPendingIRQ(res_.irqn);
  ConfigureTxDma();
  ApplyConfig(config);
  if (res_.rx_mode == RxMode::EXTEND_DMA)
  {
    ConfigureRxDma();
  }
  instance_map_[res_.index] = this;
  StartDataPath();

  NVIC_EnableIRQ(res_.irqn);
}

ErrorCode MSPM0UART::ValidateConfig(UART::Configuration config) const
{
  if (!BaudRateRepresentable(res_.clock_freq, config.baudrate) || config.data_bits < 5U ||
      config.data_bits > 8U || (config.stop_bits != 1U && config.stop_bits != 2U))
  {
    return ErrorCode::ARG_ERR;
  }
  if (config.parity != UART::Parity::NO_PARITY && config.parity != UART::Parity::EVEN &&
      config.parity != UART::Parity::ODD)
  {
    return ErrorCode::ARG_ERR;
  }
  if (res_.rx_mode == RxMode::EXTEND_DMA)
  {
    const uint64_t gap = GapCompare(res_.clock_freq, config);
    if (gap == 0U || gap > std::numeric_limits<uint16_t>::max())
    {
      return ErrorCode::ARG_ERR;
    }
  }
  return ErrorCode::OK;
}

