Jiu-xiao/libxr/driver/mspm0/mspm0_uart.cpp
UART::Configuration MSPM0UART::BuildConfigFromSysCfg(UART_Regs* instance,
                                                     uint32_t baudrate)
{
  DEV_ASSERT(instance != nullptr);
  DEV_ASSERT(baudrate > 0U);

  UART::Configuration config = {baudrate, UART::Parity::NO_PARITY, 8U, 1U};
  switch (DL_UART_getWordLength(instance))
  {
    case DL_UART_WORD_LENGTH_5_BITS:
      config.data_bits = 5U;
      break;
    case DL_UART_WORD_LENGTH_6_BITS:
      config.data_bits = 6U;
      break;
    case DL_UART_WORD_LENGTH_7_BITS:
      config.data_bits = 7U;
      break;
    case DL_UART_WORD_LENGTH_8_BITS:
    default:
      config.data_bits = 8U;
      break;
  }

  switch (DL_UART_getParityMode(instance))
  {
    case DL_UART_PARITY_NONE:
      config.parity = UART::Parity::NO_PARITY;
      break;
    case DL_UART_PARITY_EVEN:
      config.parity = UART::Parity::EVEN;
      break;
    case DL_UART_PARITY_ODD:
      config.parity = UART::Parity::ODD;
      break;
    default:
      DEV_ASSERT(false);
      break;
  }
  config.stop_bits = DL_UART_getStopBits(instance) == DL_UART_STOP_BITS_TWO ? 2U : 1U;
  return config;
}

ErrorCode MSPM0UART::SetConfig(UART::Configuration config, bool in_isr)
{
  const ErrorCode validation = ValidateConfig(config);
  if (validation != ErrorCode::OK)
  {
    return validation;
  }

  ConfigState expected = ConfigState::EMPTY;
  if (!config_state_.compare_exchange_strong(expected, ConfigState::RESERVED,
                                             std::memory_order_acq_rel,
                                             std::memory_order_acquire))
  {
    return ErrorCode::BUSY;
  }

  // 配置内容通过下方事件发布，由处理器将槽标记为 PUBLISHED。
  // Publish the payload through the event; the service marks the slot PUBLISHED.
  pending_config_ = config;
  service_.Invoke(EVENT_CONFIG, in_isr, [this](uint32_t events, bool owner_in_isr)
                  { HandleService(events, owner_in_isr); });
  return ErrorCode::OK;
}

void MSPM0UART::WriteFun(WritePort& port, bool in_isr)
{
  auto* uart = LibXR::ContainerOf(&port, &MSPM0UART::_write_port);
  uart->service_.Invoke(EVENT_WRITE, in_isr, [uart](uint32_t events, bool owner_in_isr)
                        { uart->HandleService(events, owner_in_isr); });
}

void MSPM0UART::NotifyReadSpace(bool in_isr)
{
  service_.Invoke(EVENT_RX_WORK, in_isr, [this](uint32_t events, bool owner_in_isr)
                  { HandleService(events, owner_in_isr); });
}

void MSPM0UART::HandleService(uint32_t events, bool in_isr)
{
  if ((events & EVENT_CONFIG) != 0U)
  {
    DEV_ASSERT_FROM_CALLBACK(
        config_state_.load(std::memory_order_acquire) == ConfigState::RESERVED, in_isr);
    config_state_.store(ConfigState::PUBLISHED, std::memory_order_release);
  }

  if ((events & EVENT_DMA_DONE_TX) != 0U)
  {
    HandleTxDone(in_isr);
  }

  if ((events & EVENT_RX_WORK) != 0U)
  {
    HandleRxWork(in_isr);
  }

  if ((events & (EVENT_CONFIG | EVENT_DMA_DONE_TX | EVENT_EOT_DONE | EVENT_RX_WORK)) !=
      0U)
  {
    TryApplyPublishedConfig(in_isr);
  }

  if (events != 0U && config_state_.load(std::memory_order_acquire) == ConfigState::EMPTY)
  {
    if ((events & (EVENT_WRITE | EVENT_DMA_DONE_TX | EVENT_CONFIG | EVENT_EOT_DONE)) !=
        0U)
    {
      FillTx(in_isr);
    }
  }
}

void MSPM0UART::FillTx(bool in_isr)
{
  while (config_state_.load(std::memory_order_acquire) == ConfigState::EMPTY)
  {
    if (active_half_ < 0)
    {
      for (uint8_t half = 0U; half < 2U; ++half)
      {
        if (tx_half_size_used_[half] != 0U)
        {
          if (config_state_.load(std::memory_order_acquire) != ConfigState::EMPTY)
          {
            return;
          }
          active_half_ = static_cast<int8_t>(half);
          StartTxDma(half, tx_half_size_used_[half]);
          break;
        }
      }
    }

    uint8_t free_half = INVALID_DMA_CHANNEL;
    for (uint8_t i = 0U; i < 2U; ++i)
    {
      if (tx_half_size_used_[i] == 0U)
      {
        free_half = i;
        break;
      }
    }
    if (free_half == INVALID_DMA_CHANNEL)
    {
      return;
    }

    size_t size = 0U;
    {
      auto queue = _write_port.GetWriteQueue(in_isr);
      if (queue.Empty())
      {
        return;
      }
      if (config_state_.load(std::memory_order_acquire) != ConfigState::EMPTY)
      {
        return;
      }

      size = queue.AvailableSize();
      DEV_ASSERT_FROM_CALLBACK(size > 0U && size <= tx_half_size_, in_isr);
      queue.PopAll(TxHalf(free_half));
      tx_half_size_used_[free_half] = size;
    }

    if (active_half_ < 0 &&
        config_state_.load(std::memory_order_acquire) == ConfigState::EMPTY)
    {
      active_half_ = static_cast<int8_t>(free_half);
      StartTxDma(free_half, size);
    }
  }
}

void MSPM0UART::HandleTxDone(bool in_isr)
{
  DEV_ASSERT_FROM_CALLBACK(active_half_ >= 0 && active_half_ < 2, in_isr);
  const uint8_t completed = static_cast<uint8_t>(active_half_);
  tx_half_size_used_[completed] = 0U;
  active_half_ = -1;

  const uint8_t next = completed ^ 1U;
  if (tx_half_size_used_[next] != 0U &&
      config_state_.load(std::memory_order_acquire) == ConfigState::EMPTY)
  {
    active_half_ = static_cast<int8_t>(next);
    StartTxDma(next, tx_half_size_used_[next]);
  }
  else
  {
    DL_UART_disableInterrupt(res_.instance, TX_DONE_INTERRUPT_MASK);
    DL_UART_disableDMATransmitEvent(res_.instance);
  }
}

void MSPM0UART::HandleRxWork(bool in_isr)
{
  if (res_.rx_mode == RxMode::MAIN_BYTE_IRQ)
  {
    HandleMainRx(in_isr);
  }
  else
  {
    HandleExtendRx(in_isr);
  }
}

void MSPM0UART::HandleMainRx(bool in_isr)
{
  auto queue = _read_port.GetReadQueue(in_isr);
  if (queue.EmptySize() != 0U)
  {
    DL_UART_enableInterrupt(res_.instance, RX_INTERRUPT_MASK);
  }

  while (!DL_UART_isRXFIFOEmpty(res_.instance))
  {
    if (queue.EmptySize() == 0U)
    {
      DL_UART_disableInterrupt(res_.instance, RX_INTERRUPT_MASK);
      break;
    }

    const uint8_t byte = DL_UART_receiveData(res_.instance);
    [[maybe_unused]] const auto push_batch_result = queue.PushBatch(&byte, 1U);
    DEV_ASSERT_FROM_CALLBACK(push_batch_result == ErrorCode::OK, in_isr);
  }
  queue.Publish();
}

void MSPM0UART::HandleExtendRx(bool in_isr)
{
  const size_t capacity = RxCapacity();
  DEV_ASSERT_FROM_CALLBACK(capacity > 1U, in_isr);

