Jiu-xiao/libxr/driver/mspm0/mspm0_uart.cpp
  const uint32_t remaining = DL_DMA_getTransferSize(DMA, res_.dma_rx_channel);
  DEV_ASSERT_FROM_CALLBACK(remaining <= capacity, in_isr);

  const size_t position = remaining == 0U ? capacity : capacity - remaining;
  const size_t cursor = rx_dma_cursor_;
  DEV_ASSERT_FROM_CALLBACK(cursor < capacity, in_isr);

  const size_t first_size = position >= cursor ? position - cursor : capacity - cursor;
  const size_t second_size = position >= cursor ? 0U : position;
  const size_t observed = first_size + second_size;

  auto queue = _read_port.GetReadQueue(in_isr);
  size_t accepted = std::min(observed, queue.EmptySize());
  size_t first_accepted = std::min(first_size, accepted);
  if (first_accepted != 0U)
  {
    auto* source = static_cast<const uint8_t*>(rx_dma_storage_.addr_) + cursor;
    [[maybe_unused]] const auto push_batch_result =
        queue.PushBatch(source, first_accepted);
    DEV_ASSERT_FROM_CALLBACK(push_batch_result == ErrorCode::OK, in_isr);
    accepted -= first_accepted;
  }
  if (accepted != 0U)
  {
    [[maybe_unused]] const auto push_batch_result =
        queue.PushBatch(static_cast<const uint8_t*>(rx_dma_storage_.addr_), accepted);
    DEV_ASSERT_FROM_CALLBACK(push_batch_result == ErrorCode::OK, in_isr);
  }

  // 超出软件容量的尾部作为溢出丢弃，回调前先推进游标。
  // Drop excess bytes and advance the cursor before callbacks can run.
  rx_dma_cursor_ = position == capacity ? 0U : position;
  queue.Publish();
}

void MSPM0UART::HandleUartInterrupt()
{
  constexpr uint32_t MASK = RX_ERROR_INTERRUPT_MASK | RX_INTERRUPT_MASK |
                            RX_TIMEOUT_INTERRUPT_MASK | TX_DONE_INTERRUPT_MASK |
                            EOT_INTERRUPT_MASK | RX_GAP_INTERRUPT_MASK;
  const uint32_t pending = DL_UART_getEnabledInterruptStatus(res_.instance, MASK);
  if (pending == 0U)
  {
    return;
  }

  if ((pending & RX_TIMEOUT_INTERRUPT_MASK) != 0U)
  {
    DL_UART_disableInterrupt(res_.instance, RX_TIMEOUT_INTERRUPT_MASK);
  }
  DL_UART_clearInterruptStatus(res_.instance, pending & MASK);

  uint32_t events = 0U;
  if ((pending &
       (RX_INTERRUPT_MASK | RX_TIMEOUT_INTERRUPT_MASK | RX_GAP_INTERRUPT_MASK)) != 0U)
  {
    events |= EVENT_RX_WORK;
  }
  if ((pending & TX_DONE_INTERRUPT_MASK) != 0U)
  {
    events |= EVENT_DMA_DONE_TX;
  }
  if ((pending & EOT_INTERRUPT_MASK) != 0U)
  {
    events |= EVENT_EOT_DONE;
  }

  if (events != 0U)
  {
    service_.Invoke(events, true, [this](uint32_t handled, bool in_isr)
                    { HandleService(handled, in_isr); });
  }
}

void MSPM0UART::HandleRxDmaInterrupt()
{
  service_.Invoke(EVENT_RX_WORK, true, [this](uint32_t events, bool in_isr)
                  { HandleService(events, in_isr); });
}

void MSPM0UART::OnInterrupt(uint8_t index)
{
  if (index < MAX_UART_INSTANCES && instance_map_[index] != nullptr)
  {
    instance_map_[index]->HandleUartInterrupt();
  }
}

void MSPM0UART::OnDmaInterrupt()
{
  uint32_t owned_mask = 0U;
  for (MSPM0UART* uart : instance_map_)
  {
    if (uart != nullptr && uart->res_.rx_mode == RxMode::EXTEND_DMA)
    {
      owned_mask |= DmaRawMask(uart->res_.dma_rx_channel, uart->res_.rx_half_interrupt);
    }
  }

  if (owned_mask == 0U)
  {
    return;
  }

  const uint32_t pending = DL_DMA_getEnabledInterruptStatus(DMA, owned_mask);
  for (MSPM0UART* uart : instance_map_)
  {
    if (uart == nullptr || uart->res_.rx_mode != RxMode::EXTEND_DMA)
    {
      continue;
    }

    const uint32_t mask =
        DmaRawMask(uart->res_.dma_rx_channel, uart->res_.rx_half_interrupt);
    const uint32_t hit = pending & mask;
    if (hit != 0U)
    {
      DL_DMA_clearInterruptStatus(DMA, hit);
      uart->HandleRxDmaInterrupt();
    }
  }
  __DSB();
}

void MSPM0UARTReadPort::OnReadQueueSpaceAvailable(bool in_isr)
{
  DEV_ASSERT_FROM_CALLBACK(owner_ != nullptr, in_isr);
  owner_->NotifyReadSpace(in_isr);
}

void MSPM0UART::ConfigureTxDma()
{
  DL_DMA_Config config = UART_DMA_TX_CONFIG;
  config.trigger = res_.dma_tx_trigger;
  DL_DMA_disableChannel(DMA, res_.dma_tx_channel);
  DL_DMA_clearInterruptStatus(DMA, DmaCompleteMask(res_.dma_tx_channel));
  DL_DMA_initChannel(DMA, res_.dma_tx_channel, &config);
}

void MSPM0UART::ConfigureRxDma()
{
#if defined(DEVICE_HAS_DMA_FULL_CHANNEL)
  if (res_.rx_mode != RxMode::EXTEND_DMA)
  {
    return;
  }

  DL_DMA_Config config = UART_DMA_RX_CONFIG;
  config.trigger = res_.dma_rx_trigger;
  DL_DMA_disableChannel(DMA, res_.dma_rx_channel);
  DL_DMA_initChannel(DMA, res_.dma_rx_channel, &config);
  DL_DMA_setSrcAddr(
      DMA, res_.dma_rx_channel,
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&res_.instance->RXDATA)));
  DL_DMA_setDestAddr(
      DMA, res_.dma_rx_channel,
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(rx_dma_storage_.addr_)));
  DL_DMA_setTransferSize(DMA, res_.dma_rx_channel,
                         static_cast<uint16_t>(rx_dma_storage_.size_));
  if (res_.rx_half_interrupt)
  {
    DL_DMA_Full_Ch_setEarlyInterruptThreshold(DMA, res_.dma_rx_channel,
                                              DL_DMA_EARLY_INTERRUPT_THRESHOLD_HALF);
  }
#else
  DEV_ASSERT(false);
#endif
}

void MSPM0UART::ApplyConfig(UART::Configuration config)
{
  DL_UART_changeConfig(res_.instance);

  DL_UART_WORD_LENGTH word_length = DL_UART_WORD_LENGTH_8_BITS;
  switch (config.data_bits)
  {
    case 5U:
      word_length = DL_UART_WORD_LENGTH_5_BITS;
      break;
    case 6U:
      word_length = DL_UART_WORD_LENGTH_6_BITS;
      break;
    case 7U:
      word_length = DL_UART_WORD_LENGTH_7_BITS;
      break;
    case 8U:
      break;
    default:
      DEV_ASSERT(false);
      break;
  }

  DL_UART_PARITY parity = DL_UART_PARITY_NONE;
  if (config.parity == UART::Parity::EVEN)
  {
    parity = DL_UART_PARITY_EVEN;
  }
  else if (config.parity == UART::Parity::ODD)
  {
    parity = DL_UART_PARITY_ODD;
  }

  DL_UART_setWordLength(res_.instance, word_length);
  DL_UART_setParityMode(res_.instance, parity);
  DL_UART_setStopBits(res_.instance, config.stop_bits == 2U ? DL_UART_STOP_BITS_TWO
                                                            : DL_UART_STOP_BITS_ONE);
  DL_UART_setCommunicationMode(res_.instance, DL_UART_MODE_NORMAL);
  DL_UART_setDirection(res_.instance, DL_UART_DIRECTION_TX_RX);
  DL_UART_enableFIFOs(res_.instance);
  DL_UART_setTXFIFOThreshold(res_.instance, DL_UART_TX_FIFO_LEVEL_ONE_ENTRY);
  DL_UART_setRXFIFOThreshold(res_.instance, DL_UART_RX_FIFO_LEVEL_ONE_ENTRY);
  DL_UART_setRXInterruptTimeout(res_.instance, 0U);
  DL_UART_configBaudRate(res_.instance, res_.clock_freq, config.baudrate);

  if (res_.rx_mode == RxMode::EXTEND_DMA)
  {
    DL_UART_setLINCounterValue(res_.instance, 0U);
    DL_UART_setLINCounterCompareValue(
        res_.instance, static_cast<uint16_t>(GapCompare(res_.clock_freq, config)));
    DL_UART_enableLINCounterCompareMatch(res_.instance);
    DL_UART_disableLINCountWhileLow(res_.instance);
    DL_UART_enableLINCounterClearOnFallingEdge(res_.instance);
    DL_UART_enableLINCounter(res_.instance);
  }
}

void MSPM0UART::StartDataPath()
{
  DL_UART_disableInterrupt(res_.instance, 0xFFFFFFFFU);
  DL_UART_clearInterruptStatus(res_.instance, 0xFFFFFFFFU);
  DL_UART_clearDMATransmitEventStatus(res_.instance);
  DL_UART_clearDMAReceiveEventStatus(res_.instance, DL_UART_DMA_INTERRUPT_RX);
  DL_UART_disableDMAReceiveEvent(res_.instance, DL_UART_DMA_INTERRUPT_RX);
  DL_UART_disableDMATransmitEvent(res_.instance);
  DL_UART_enableInterrupt(res_.instance, RX_ERROR_INTERRUPT_MASK);

