Jiu-xiao/libxr/driver/mspm0/mspm0_uart.cpp
  if (res_.rx_mode == RxMode::MAIN_BYTE_IRQ)
  {
    DL_UART_enableInterrupt(res_.instance, RX_INTERRUPT_MASK);
  }
  else
  {
    const uint32_t dma_mask = DmaRawMask(res_.dma_rx_channel, res_.rx_half_interrupt);
    DL_DMA_clearInterruptStatus(DMA, dma_mask);
    DL_DMA_enableInterrupt(DMA, dma_mask);
    DL_DMA_enableChannel(DMA, res_.dma_rx_channel);
    DL_UART_enableInterrupt(res_.instance, RX_GAP_INTERRUPT_MASK);
    DL_UART_enableDMAReceiveEvent(res_.instance, DL_UART_DMA_INTERRUPT_RX);
    rx_dma_cursor_ = 0U;
  }

  __DMB();
  DL_UART_enable(res_.instance);
}

void MSPM0UART::StopDataPath()
{
  DL_UART_disableInterrupt(res_.instance, RX_ERROR_INTERRUPT_MASK | RX_INTERRUPT_MASK |
                                              RX_TIMEOUT_INTERRUPT_MASK |
                                              TX_DONE_INTERRUPT_MASK |
                                              EOT_INTERRUPT_MASK | RX_GAP_INTERRUPT_MASK);
  DL_UART_disableDMAReceiveEvent(res_.instance, DL_UART_DMA_INTERRUPT_RX);
  DL_UART_disableDMATransmitEvent(res_.instance);
  if (res_.rx_mode == RxMode::EXTEND_DMA)
  {
    DL_DMA_disableChannel(DMA, res_.dma_rx_channel);
    DL_DMA_disableInterrupt(DMA, DmaRawMask(res_.dma_rx_channel, res_.rx_half_interrupt));
  }
  DL_UART_disable(res_.instance);
}

void MSPM0UART::DiscardRxFifo()
{
  while (!DL_UART_isRXFIFOEmpty(res_.instance))
  {
    (void)DL_UART_receiveData(res_.instance);
  }
}

void MSPM0UART::StartTxDma(uint8_t half, size_t size)
{
  DEV_ASSERT(half < 2U);
  DEV_ASSERT(size > 0U && size <= tx_half_size_);

  DL_DMA_disableChannel(DMA, res_.dma_tx_channel);
  DL_DMA_clearInterruptStatus(DMA, DmaCompleteMask(res_.dma_tx_channel));
  DL_DMA_setSrcAddr(DMA, res_.dma_tx_channel,
                    static_cast<uint32_t>(reinterpret_cast<uintptr_t>(TxHalf(half))));
  DL_DMA_setDestAddr(
      DMA, res_.dma_tx_channel,
      static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&res_.instance->TXDATA)));
  DL_DMA_setTransferSize(DMA, res_.dma_tx_channel, static_cast<uint16_t>(size));
  DL_UART_clearInterruptStatus(res_.instance,
                               TX_DONE_INTERRUPT_MASK | EOT_INTERRUPT_MASK);
  DL_UART_enableInterrupt(res_.instance, TX_DONE_INTERRUPT_MASK);
  DL_UART_enableDMATransmitEvent(res_.instance);
  __DMB();
  DL_DMA_enableChannel(DMA, res_.dma_tx_channel);
}

void MSPM0UART::TryApplyPublishedConfig(bool in_isr)
{
  if (config_state_.load(std::memory_order_acquire) != ConfigState::PUBLISHED)
  {
    return;
  }

  if (active_half_ >= 0)
  {
    return;
  }

  if (DL_UART_isBusy(res_.instance))
  {
    DL_UART_enableInterrupt(res_.instance, EOT_INTERRUPT_MASK);
    if (res_.rx_mode == RxMode::MAIN_BYTE_IRQ)
    {
      DL_UART_disableInterrupt(res_.instance, RX_TIMEOUT_INTERRUPT_MASK);
      DL_UART_clearInterruptStatus(res_.instance, RX_TIMEOUT_INTERRUPT_MASK);
      DL_UART_setRXInterruptTimeout(res_.instance, CONFIG_RX_TIMEOUT);
      DL_UART_enableInterrupt(res_.instance, RX_TIMEOUT_INTERRUPT_MASK);
    }
    return;
  }

  const UART::Configuration config = pending_config_;
  StopDataPath();
  DiscardRxFifo();
  ApplyConfig(config);
  if (res_.rx_mode == RxMode::EXTEND_DMA)
  {
    ConfigureRxDma();
  }
  config_state_.store(ConfigState::EMPTY, std::memory_order_release);
  StartDataPath();
  // 当前处理器仍持有执行权，会在本轮结束后处理这些通知。
  // The active service will process these hints after this pass.
  service_.Publish(EVENT_WRITE | EVENT_RX_WORK);
  UNUSED(in_isr);
}

#if defined(UART0_BASE)
extern "C" void UART0_IRQHandler(void) { MSPM0UART::OnInterrupt(0U); }
#endif
#if defined(UART1_BASE)
extern "C" void UART1_IRQHandler(void) { MSPM0UART::OnInterrupt(1U); }
#endif
#if defined(UART2_BASE)
extern "C" void UART2_IRQHandler(void) { MSPM0UART::OnInterrupt(2U); }
#endif
#if defined(UART3_BASE)
extern "C" void UART3_IRQHandler(void) { MSPM0UART::OnInterrupt(3U); }
#endif
#if defined(UART4_BASE)
extern "C" void UART4_IRQHandler(void) { MSPM0UART::OnInterrupt(4U); }
#endif
#if defined(UART5_BASE)
extern "C" void UART5_IRQHandler(void) { MSPM0UART::OnInterrupt(5U); }
#endif
#if defined(UART6_BASE)
extern "C" void UART6_IRQHandler(void) { MSPM0UART::OnInterrupt(6U); }
#endif
#if defined(UART7_BASE)
extern "C" void UART7_IRQHandler(void) { MSPM0UART::OnInterrupt(7U); }
#endif
